zephyrproject-rtos/hal_nxp/dts/nxp/lpc/lpc54xxx/pinctrl/LPC54616J256ET180-pinctrl.h
#define DMA0_TRIG8_PIO1_15 IOCON_MUX(47, IOCON_TYPE_D, 0) /* PIO1_15 */
#define DMA0_TRIG9_PIO1_15 IOCON_MUX(47, IOCON_TYPE_D, 0) /* PIO1_15 */
#define EMC_EMC_CKE0_PIO1_15 IOCON_MUX(47, IOCON_TYPE_D, 6) /* PIO1_15 */
#define ENET_RX_CLK_PIO1_15 IOCON_MUX(47, IOCON_TYPE_D, 1) /* PIO1_15 */
#define FC4_RTS_SCL_SSEL1_PIO1_15 IOCON_MUX(47, IOCON_TYPE_D, 5) /* PIO1_15 */
#define FC5_RTS_SCL_SSEL1_PIO1_15 IOCON_MUX(47, IOCON_TYPE_D, 4) /* PIO1_15 */
#define GPIO_PIO115_PIO1_15 IOCON_MUX(47, IOCON_TYPE_D, 0) /* PIO1_15 */
#define PINT_PINT0_PIO1_15 IOCON_MUX(47, IOCON_TYPE_D, 0) /* PIO1_15 */
#define PINT_PINT1_PIO1_15 IOCON_MUX(47, IOCON_TYPE_D, 0) /* PIO1_15 */
#define PINT_PINT2_PIO1_15 IOCON_MUX(47, IOCON_TYPE_D, 0) /* PIO1_15 */
#define PINT_PINT3_PIO1_15 IOCON_MUX(47, IOCON_TYPE_D, 0) /* PIO1_15 */
#define PINT_PINT4_PIO1_15 IOCON_MUX(47, IOCON_TYPE_D, 0) /* PIO1_15 */
#define PINT_PINT5_PIO1_15 IOCON_MUX(47, IOCON_TYPE_D, 0) /* PIO1_15 */
#define PINT_PINT6_PIO1_15 IOCON_MUX(47, IOCON_TYPE_D, 0) /* PIO1_15 */
#define PINT_PINT7_PIO1_15 IOCON_MUX(47, IOCON_TYPE_D, 0) /* PIO1_15 */
#define UTICK0_CAPTURE3_PIO1_15 IOCON_MUX(47, IOCON_TYPE_D, 2) /* PIO1_15 */
#define ADC0_TRIG1_PIO1_16 IOCON_MUX(48, IOCON_TYPE_D, 0) /* PIO1_16 */
#define ADC0_TRIG2_PIO1_16 IOCON_MUX(48, IOCON_TYPE_D, 0) /* PIO1_16 */
#define CTIMER1_MATCH3_PIO1_16 IOCON_MUX(48, IOCON_TYPE_D, 3) /* PIO1_16 */
#define DMA0_TRIG0_PIO1_16 IOCON_MUX(48, IOCON_TYPE_D, 0) /* PIO1_16 */
#define DMA0_TRIG10_PIO1_16 IOCON_MUX(48, IOCON_TYPE_D, 0) /* PIO1_16 */
#define DMA0_TRIG11_PIO1_16 IOCON_MUX(48, IOCON_TYPE_D, 0) /* PIO1_16 */
#define DMA0_TRIG12_PIO1_16 IOCON_MUX(48, IOCON_TYPE_D, 0) /* PIO1_16 */
#define DMA0_TRIG13_PIO1_16 IOCON_MUX(48, IOCON_TYPE_D, 0) /* PIO1_16 */
#define DMA0_TRIG14_PIO1_16 IOCON_MUX(48, IOCON_TYPE_D, 0) /* PIO1_16 */
#define DMA0_TRIG15_PIO1_16 IOCON_MUX(48, IOCON_TYPE_D, 0) /* PIO1_16 */
#define DMA0_TRIG16_PIO1_16 IOCON_MUX(48, IOCON_TYPE_D, 0) /* PIO1_16 */
#define DMA0_TRIG17_PIO1_16 IOCON_MUX(48, IOCON_TYPE_D, 0) /* PIO1_16 */
#define DMA0_TRIG18_PIO1_16 IOCON_MUX(48, IOCON_TYPE_D, 0) /* PIO1_16 */
#define DMA0_TRIG19_PIO1_16 IOCON_MUX(48, IOCON_TYPE_D, 0) /* PIO1_16 */
#define DMA0_TRIG1_PIO1_16 IOCON_MUX(48, IOCON_TYPE_D, 0) /* PIO1_16 */
#define DMA0_TRIG20_PIO1_16 IOCON_MUX(48, IOCON_TYPE_D, 0) /* PIO1_16 */
#define DMA0_TRIG21_PIO1_16 IOCON_MUX(48, IOCON_TYPE_D, 0) /* PIO1_16 */
#define DMA0_TRIG22_PIO1_16 IOCON_MUX(48, IOCON_TYPE_D, 0) /* PIO1_16 */
#define DMA0_TRIG23_PIO1_16 IOCON_MUX(48, IOCON_TYPE_D, 0) /* PIO1_16 */
#define DMA0_TRIG24_PIO1_16 IOCON_MUX(48, IOCON_TYPE_D, 0) /* PIO1_16 */
#define DMA0_TRIG25_PIO1_16 IOCON_MUX(48, IOCON_TYPE_D, 0) /* PIO1_16 */
#define DMA0_TRIG26_PIO1_16 IOCON_MUX(48, IOCON_TYPE_D, 0) /* PIO1_16 */
#define DMA0_TRIG27_PIO1_16 IOCON_MUX(48, IOCON_TYPE_D, 0) /* PIO1_16 */
#define DMA0_TRIG28_PIO1_16 IOCON_MUX(48, IOCON_TYPE_D, 0) /* PIO1_16 */
#define DMA0_TRIG29_PIO1_16 IOCON_MUX(48, IOCON_TYPE_D, 0) /* PIO1_16 */
#define DMA0_TRIG2_PIO1_16 IOCON_MUX(48, IOCON_TYPE_D, 0) /* PIO1_16 */
#define DMA0_TRIG3_PIO1_16 IOCON_MUX(48, IOCON_TYPE_D, 0) /* PIO1_16 */
#define DMA0_TRIG4_PIO1_16 IOCON_MUX(48, IOCON_TYPE_D, 0) /* PIO1_16 */
#define DMA0_TRIG5_PIO1_16 IOCON_MUX(48, IOCON_TYPE_D, 0) /* PIO1_16 */
#define DMA0_TRIG6_PIO1_16 IOCON_MUX(48, IOCON_TYPE_D, 0) /* PIO1_16 */
#define DMA0_TRIG7_PIO1_16 IOCON_MUX(48, IOCON_TYPE_D, 0) /* PIO1_16 */
#define DMA0_TRIG8_PIO1_16 IOCON_MUX(48, IOCON_TYPE_D, 0) /* PIO1_16 */
#define DMA0_TRIG9_PIO1_16 IOCON_MUX(48, IOCON_TYPE_D, 0) /* PIO1_16 */
#define EMC_EMC_A10_PIO1_16 IOCON_MUX(48, IOCON_TYPE_D, 6) /* PIO1_16 */
#define ENET_MDC_PIO1_16 IOCON_MUX(48, IOCON_TYPE_D, 1) /* PIO1_16 */
#define FC6_TXD_SCL_MISO_WS_PIO1_16 IOCON_MUX(48, IOCON_TYPE_D, 2) /* PIO1_16 */
#define GPIO_PIO116_PIO1_16 IOCON_MUX(48, IOCON_TYPE_D, 0) /* PIO1_16 */
#define PINT_PINT0_PIO1_16 IOCON_MUX(48, IOCON_TYPE_D, 0) /* PIO1_16 */
#define PINT_PINT1_PIO1_16 IOCON_MUX(48, IOCON_TYPE_D, 0) /* PIO1_16 */
#define PINT_PINT2_PIO1_16 IOCON_MUX(48, IOCON_TYPE_D, 0) /* PIO1_16 */
#define PINT_PINT3_PIO1_16 IOCON_MUX(48, IOCON_TYPE_D, 0) /* PIO1_16 */
#define PINT_PINT4_PIO1_16 IOCON_MUX(48, IOCON_TYPE_D, 0) /* PIO1_16 */
#define PINT_PINT5_PIO1_16 IOCON_MUX(48, IOCON_TYPE_D, 0) /* PIO1_16 */
#define PINT_PINT6_PIO1_16 IOCON_MUX(48, IOCON_TYPE_D, 0) /* PIO1_16 */
#define PINT_PINT7_PIO1_16 IOCON_MUX(48, IOCON_TYPE_D, 0) /* PIO1_16 */
#define SD_CMD_PIO1_16 IOCON_MUX(48, IOCON_TYPE_D, 4) /* PIO1_16 */
#define ADC0_TRIG1_PIO1_17 IOCON_MUX(49, IOCON_TYPE_D, 0) /* PIO1_17 */
#define ADC0_TRIG2_PIO1_17 IOCON_MUX(49, IOCON_TYPE_D, 0) /* PIO1_17 */
#define CAN1_TD_PIO1_17 IOCON_MUX(49, IOCON_TYPE_D, 5) /* PIO1_17 */
#define DMA0_TRIG0_PIO1_17 IOCON_MUX(49, IOCON_TYPE_D, 0) /* PIO1_17 */
#define DMA0_TRIG10_PIO1_17 IOCON_MUX(49, IOCON_TYPE_D, 0) /* PIO1_17 */
#define DMA0_TRIG11_PIO1_17 IOCON_MUX(49, IOCON_TYPE_D, 0) /* PIO1_17 */
#define DMA0_TRIG12_PIO1_17 IOCON_MUX(49, IOCON_TYPE_D, 0) /* PIO1_17 */
#define DMA0_TRIG13_PIO1_17 IOCON_MUX(49, IOCON_TYPE_D, 0) /* PIO1_17 */
#define DMA0_TRIG14_PIO1_17 IOCON_MUX(49, IOCON_TYPE_D, 0) /* PIO1_17 */
#define DMA0_TRIG15_PIO1_17 IOCON_MUX(49, IOCON_TYPE_D, 0) /* PIO1_17 */
#define DMA0_TRIG16_PIO1_17 IOCON_MUX(49, IOCON_TYPE_D, 0) /* PIO1_17 */
#define DMA0_TRIG17_PIO1_17 IOCON_MUX(49, IOCON_TYPE_D, 0) /* PIO1_17 */
#define DMA0_TRIG18_PIO1_17 IOCON_MUX(49, IOCON_TYPE_D, 0) /* PIO1_17 */
#define DMA0_TRIG19_PIO1_17 IOCON_MUX(49, IOCON_TYPE_D, 0) /* PIO1_17 */
#define DMA0_TRIG1_PIO1_17 IOCON_MUX(49, IOCON_TYPE_D, 0) /* PIO1_17 */
#define DMA0_TRIG20_PIO1_17 IOCON_MUX(49, IOCON_TYPE_D, 0) /* PIO1_17 */
#define DMA0_TRIG21_PIO1_17 IOCON_MUX(49, IOCON_TYPE_D, 0) /* PIO1_17 */
#define DMA0_TRIG22_PIO1_17 IOCON_MUX(49, IOCON_TYPE_D, 0) /* PIO1_17 */
#define DMA0_TRIG23_PIO1_17 IOCON_MUX(49, IOCON_TYPE_D, 0) /* PIO1_17 */
#define DMA0_TRIG24_PIO1_17 IOCON_MUX(49, IOCON_TYPE_D, 0) /* PIO1_17 */
#define DMA0_TRIG25_PIO1_17 IOCON_MUX(49, IOCON_TYPE_D, 0) /* PIO1_17 */
#define DMA0_TRIG26_PIO1_17 IOCON_MUX(49, IOCON_TYPE_D, 0) /* PIO1_17 */
#define DMA0_TRIG27_PIO1_17 IOCON_MUX(49, IOCON_TYPE_D, 0) /* PIO1_17 */
#define DMA0_TRIG28_PIO1_17 IOCON_MUX(49, IOCON_TYPE_D, 0) /* PIO1_17 */
#define DMA0_TRIG29_PIO1_17 IOCON_MUX(49, IOCON_TYPE_D, 0) /* PIO1_17 */
#define DMA0_TRIG2_PIO1_17 IOCON_MUX(49, IOCON_TYPE_D, 0) /* PIO1_17 */
#define DMA0_TRIG3_PIO1_17 IOCON_MUX(49, IOCON_TYPE_D, 0) /* PIO1_17 */
#define DMA0_TRIG4_PIO1_17 IOCON_MUX(49, IOCON_TYPE_D, 0) /* PIO1_17 */
#define DMA0_TRIG5_PIO1_17 IOCON_MUX(49, IOCON_TYPE_D, 0) /* PIO1_17 */
#define DMA0_TRIG6_PIO1_17 IOCON_MUX(49, IOCON_TYPE_D, 0) /* PIO1_17 */
#define DMA0_TRIG7_PIO1_17 IOCON_MUX(49, IOCON_TYPE_D, 0) /* PIO1_17 */
#define DMA0_TRIG8_PIO1_17 IOCON_MUX(49, IOCON_TYPE_D, 0) /* PIO1_17 */
#define DMA0_TRIG9_PIO1_17 IOCON_MUX(49, IOCON_TYPE_D, 0) /* PIO1_17 */
#define EMC_EMC_BLS0_PIO1_17 IOCON_MUX(49, IOCON_TYPE_D, 6) /* PIO1_17 */
#define ENET_MDIO_PIO1_17 IOCON_MUX(49, IOCON_TYPE_D, 1) /* PIO1_17 */
#define FC8_RXD_SDA_MOSI_PIO1_17 IOCON_MUX(49, IOCON_TYPE_D, 2) /* PIO1_17 */
#define GPIO_PIO117_PIO1_17 IOCON_MUX(49, IOCON_TYPE_D, 0) /* PIO1_17 */
#define PINT_PINT0_PIO1_17 IOCON_MUX(49, IOCON_TYPE_D, 0) /* PIO1_17 */
#define PINT_PINT1_PIO1_17 IOCON_MUX(49, IOCON_TYPE_D, 0) /* PIO1_17 */
#define PINT_PINT2_PIO1_17 IOCON_MUX(49, IOCON_TYPE_D, 0) /* PIO1_17 */
#define PINT_PINT3_PIO1_17 IOCON_MUX(49, IOCON_TYPE_D, 0) /* PIO1_17 */
#define PINT_PINT4_PIO1_17 IOCON_MUX(49, IOCON_TYPE_D, 0) /* PIO1_17 */
#define PINT_PINT5_PIO1_17 IOCON_MUX(49, IOCON_TYPE_D, 0) /* PIO1_17 */
#define PINT_PINT6_PIO1_17 IOCON_MUX(49, IOCON_TYPE_D, 0) /* PIO1_17 */
#define PINT_PINT7_PIO1_17 IOCON_MUX(49, IOCON_TYPE_D, 0) /* PIO1_17 */
#define SCT0_OUT4_PIO1_17 IOCON_MUX(49, IOCON_TYPE_D, 4) /* PIO1_17 */
#define ADC0_TRIG1_PIO1_18 IOCON_MUX(50, IOCON_TYPE_D, 0) /* PIO1_18 */
#define ADC0_TRIG2_PIO1_18 IOCON_MUX(50, IOCON_TYPE_D, 0) /* PIO1_18 */
#define CAN1_RD_PIO1_18 IOCON_MUX(50, IOCON_TYPE_D, 5) /* PIO1_18 */
#define DMA0_TRIG0_PIO1_18 IOCON_MUX(50, IOCON_TYPE_D, 0) /* PIO1_18 */
#define DMA0_TRIG10_PIO1_18 IOCON_MUX(50, IOCON_TYPE_D, 0) /* PIO1_18 */
#define DMA0_TRIG11_PIO1_18 IOCON_MUX(50, IOCON_TYPE_D, 0) /* PIO1_18 */
#define DMA0_TRIG12_PIO1_18 IOCON_MUX(50, IOCON_TYPE_D, 0) /* PIO1_18 */
#define DMA0_TRIG13_PIO1_18 IOCON_MUX(50, IOCON_TYPE_D, 0) /* PIO1_18 */
#define DMA0_TRIG14_PIO1_18 IOCON_MUX(50, IOCON_TYPE_D, 0) /* PIO1_18 */
#define DMA0_TRIG15_PIO1_18 IOCON_MUX(50, IOCON_TYPE_D, 0) /* PIO1_18 */
#define DMA0_TRIG16_PIO1_18 IOCON_MUX(50, IOCON_TYPE_D, 0) /* PIO1_18 */
#define DMA0_TRIG17_PIO1_18 IOCON_MUX(50, IOCON_TYPE_D, 0) /* PIO1_18 */
#define DMA0_TRIG18_PIO1_18 IOCON_MUX(50, IOCON_TYPE_D, 0) /* PIO1_18 */
#define DMA0_TRIG19_PIO1_18 IOCON_MUX(50, IOCON_TYPE_D, 0) /* PIO1_18 */
#define DMA0_TRIG1_PIO1_18 IOCON_MUX(50, IOCON_TYPE_D, 0) /* PIO1_18 */
#define DMA0_TRIG20_PIO1_18 IOCON_MUX(50, IOCON_TYPE_D, 0) /* PIO1_18 */
#define DMA0_TRIG21_PIO1_18 IOCON_MUX(50, IOCON_TYPE_D, 0) /* PIO1_18 */
#define DMA0_TRIG22_PIO1_18 IOCON_MUX(50, IOCON_TYPE_D, 0) /* PIO1_18 */
#define DMA0_TRIG23_PIO1_18 IOCON_MUX(50, IOCON_TYPE_D, 0) /* PIO1_18 */
#define DMA0_TRIG24_PIO1_18 IOCON_MUX(50, IOCON_TYPE_D, 0) /* PIO1_18 */
#define DMA0_TRIG25_PIO1_18 IOCON_MUX(50, IOCON_TYPE_D, 0) /* PIO1_18 */
#define DMA0_TRIG26_PIO1_18 IOCON_MUX(50, IOCON_TYPE_D, 0) /* PIO1_18 */
#define DMA0_TRIG27_PIO1_18 IOCON_MUX(50, IOCON_TYPE_D, 0) /* PIO1_18 */
#define DMA0_TRIG28_PIO1_18 IOCON_MUX(50, IOCON_TYPE_D, 0) /* PIO1_18 */
#define DMA0_TRIG29_PIO1_18 IOCON_MUX(50, IOCON_TYPE_D, 0) /* PIO1_18 */
#define DMA0_TRIG2_PIO1_18 IOCON_MUX(50, IOCON_TYPE_D, 0) /* PIO1_18 */
#define DMA0_TRIG3_PIO1_18 IOCON_MUX(50, IOCON_TYPE_D, 0) /* PIO1_18 */
#define DMA0_TRIG4_PIO1_18 IOCON_MUX(50, IOCON_TYPE_D, 0) /* PIO1_18 */
#define DMA0_TRIG5_PIO1_18 IOCON_MUX(50, IOCON_TYPE_D, 0) /* PIO1_18 */
#define DMA0_TRIG6_PIO1_18 IOCON_MUX(50, IOCON_TYPE_D, 0) /* PIO1_18 */
#define DMA0_TRIG7_PIO1_18 IOCON_MUX(50, IOCON_TYPE_D, 0) /* PIO1_18 */
#define DMA0_TRIG8_PIO1_18 IOCON_MUX(50, IOCON_TYPE_D, 0) /* PIO1_18 */
#define DMA0_TRIG9_PIO1_18 IOCON_MUX(50, IOCON_TYPE_D, 0) /* PIO1_18 */
#define EMC_EMC_BLS1_PIO1_18 IOCON_MUX(50, IOCON_TYPE_D, 6) /* PIO1_18 */
#define FC8_TXD_SCL_MISO_PIO1_18 IOCON_MUX(50, IOCON_TYPE_D, 2) /* PIO1_18 */
#define GPIO_PIO118_PIO1_18 IOCON_MUX(50, IOCON_TYPE_D, 0) /* PIO1_18 */
#define PINT_PINT0_PIO1_18 IOCON_MUX(50, IOCON_TYPE_D, 0) /* PIO1_18 */
#define PINT_PINT1_PIO1_18 IOCON_MUX(50, IOCON_TYPE_D, 0) /* PIO1_18 */
#define PINT_PINT2_PIO1_18 IOCON_MUX(50, IOCON_TYPE_D, 0) /* PIO1_18 */
#define PINT_PINT3_PIO1_18 IOCON_MUX(50, IOCON_TYPE_D, 0) /* PIO1_18 */
#define PINT_PINT4_PIO1_18 IOCON_MUX(50, IOCON_TYPE_D, 0) /* PIO1_18 */
#define PINT_PINT5_PIO1_18 IOCON_MUX(50, IOCON_TYPE_D, 0) /* PIO1_18 */
#define PINT_PINT6_PIO1_18 IOCON_MUX(50, IOCON_TYPE_D, 0) /* PIO1_18 */
#define PINT_PINT7_PIO1_18 IOCON_MUX(50, IOCON_TYPE_D, 0) /* PIO1_18 */
#define SCT0_OUT5_PIO1_18 IOCON_MUX(50, IOCON_TYPE_D, 4) /* PIO1_18 */
#define ADC0_TRIG1_PIO1_19 IOCON_MUX(51, IOCON_TYPE_D, 0) /* PIO1_19 */
#define ADC0_TRIG2_PIO1_19 IOCON_MUX(51, IOCON_TYPE_D, 0) /* PIO1_19 */
#define CTIMER3_MATCH1_PIO1_19 IOCON_MUX(51, IOCON_TYPE_D, 3) /* PIO1_19 */
#define DMA0_TRIG0_PIO1_19 IOCON_MUX(51, IOCON_TYPE_D, 0) /* PIO1_19 */
#define DMA0_TRIG10_PIO1_19 IOCON_MUX(51, IOCON_TYPE_D, 0) /* PIO1_19 */
#define DMA0_TRIG11_PIO1_19 IOCON_MUX(51, IOCON_TYPE_D, 0) /* PIO1_19 */
#define DMA0_TRIG12_PIO1_19 IOCON_MUX(51, IOCON_TYPE_D, 0) /* PIO1_19 */
#define DMA0_TRIG13_PIO1_19 IOCON_MUX(51, IOCON_TYPE_D, 0) /* PIO1_19 */
#define DMA0_TRIG14_PIO1_19 IOCON_MUX(51, IOCON_TYPE_D, 0) /* PIO1_19 */
#define DMA0_TRIG15_PIO1_19 IOCON_MUX(51, IOCON_TYPE_D, 0) /* PIO1_19 */
#define DMA0_TRIG16_PIO1_19 IOCON_MUX(51, IOCON_TYPE_D, 0) /* PIO1_19 */
#define DMA0_TRIG17_PIO1_19 IOCON_MUX(51, IOCON_TYPE_D, 0) /* PIO1_19 */
#define DMA0_TRIG18_PIO1_19 IOCON_MUX(51, IOCON_TYPE_D, 0) /* PIO1_19 */
#define DMA0_TRIG19_PIO1_19 IOCON_MUX(51, IOCON_TYPE_D, 0) /* PIO1_19 */
#define DMA0_TRIG1_PIO1_19 IOCON_MUX(51, IOCON_TYPE_D, 0) /* PIO1_19 */
#define DMA0_TRIG20_PIO1_19 IOCON_MUX(51, IOCON_TYPE_D, 0) /* PIO1_19 */
#define DMA0_TRIG21_PIO1_19 IOCON_MUX(51, IOCON_TYPE_D, 0) /* PIO1_19 */
#define DMA0_TRIG22_PIO1_19 IOCON_MUX(51, IOCON_TYPE_D, 0) /* PIO1_19 */
#define DMA0_TRIG23_PIO1_19 IOCON_MUX(51, IOCON_TYPE_D, 0) /* PIO1_19 */
#define DMA0_TRIG24_PIO1_19 IOCON_MUX(51, IOCON_TYPE_D, 0) /* PIO1_19 */
#define DMA0_TRIG25_PIO1_19 IOCON_MUX(51, IOCON_TYPE_D, 0) /* PIO1_19 */
#define DMA0_TRIG26_PIO1_19 IOCON_MUX(51, IOCON_TYPE_D, 0) /* PIO1_19 */
#define DMA0_TRIG27_PIO1_19 IOCON_MUX(51, IOCON_TYPE_D, 0) /* PIO1_19 */
#define DMA0_TRIG28_PIO1_19 IOCON_MUX(51, IOCON_TYPE_D, 0) /* PIO1_19 */
#define DMA0_TRIG29_PIO1_19 IOCON_MUX(51, IOCON_TYPE_D, 0) /* PIO1_19 */
#define DMA0_TRIG2_PIO1_19 IOCON_MUX(51, IOCON_TYPE_D, 0) /* PIO1_19 */
#define DMA0_TRIG3_PIO1_19 IOCON_MUX(51, IOCON_TYPE_D, 0) /* PIO1_19 */
#define DMA0_TRIG4_PIO1_19 IOCON_MUX(51, IOCON_TYPE_D, 0) /* PIO1_19 */
#define DMA0_TRIG5_PIO1_19 IOCON_MUX(51, IOCON_TYPE_D, 0) /* PIO1_19 */
#define DMA0_TRIG6_PIO1_19 IOCON_MUX(51, IOCON_TYPE_D, 0) /* PIO1_19 */
#define DMA0_TRIG7_PIO1_19 IOCON_MUX(51, IOCON_TYPE_D, 0) /* PIO1_19 */
#define DMA0_TRIG8_PIO1_19 IOCON_MUX(51, IOCON_TYPE_D, 0) /* PIO1_19 */
#define DMA0_TRIG9_PIO1_19 IOCON_MUX(51, IOCON_TYPE_D, 0) /* PIO1_19 */
#define EMC_EMC_D8_PIO1_19 IOCON_MUX(51, IOCON_TYPE_D, 6) /* PIO1_19 */
#define FC4_SCK_PIO1_19 IOCON_MUX(51, IOCON_TYPE_D, 5) /* PIO1_19 */
#define FC8_SCK_PIO1_19 IOCON_MUX(51, IOCON_TYPE_D, 1) /* PIO1_19 */
#define GPIO_PIO119_PIO1_19 IOCON_MUX(51, IOCON_TYPE_D, 0) /* PIO1_19 */
#define PINT_PINT0_PIO1_19 IOCON_MUX(51, IOCON_TYPE_D, 0) /* PIO1_19 */
#define PINT_PINT1_PIO1_19 IOCON_MUX(51, IOCON_TYPE_D, 0) /* PIO1_19 */
#define PINT_PINT2_PIO1_19 IOCON_MUX(51, IOCON_TYPE_D, 0) /* PIO1_19 */
#define PINT_PINT3_PIO1_19 IOCON_MUX(51, IOCON_TYPE_D, 0) /* PIO1_19 */
#define PINT_PINT4_PIO1_19 IOCON_MUX(51, IOCON_TYPE_D, 0) /* PIO1_19 */
#define PINT_PINT5_PIO1_19 IOCON_MUX(51, IOCON_TYPE_D, 0) /* PIO1_19 */
#define PINT_PINT6_PIO1_19 IOCON_MUX(51, IOCON_TYPE_D, 0) /* PIO1_19 */
#define PINT_PINT7_PIO1_19 IOCON_MUX(51, IOCON_TYPE_D, 0) /* PIO1_19 */
#define SCT0_IN0_PIO1_19 IOCON_MUX(51, IOCON_TYPE_D, 4) /* PIO1_19 */
#define SCT0_IN1_PIO1_19 IOCON_MUX(51, IOCON_TYPE_D, 4) /* PIO1_19 */
#define SCT0_IN2_PIO1_19 IOCON_MUX(51, IOCON_TYPE_D, 4) /* PIO1_19 */
#define SCT0_IN3_PIO1_19 IOCON_MUX(51, IOCON_TYPE_D, 4) /* PIO1_19 */
#define SCT0_IN4_PIO1_19 IOCON_MUX(51, IOCON_TYPE_D, 4) /* PIO1_19 */
#define SCT0_IN5_PIO1_19 IOCON_MUX(51, IOCON_TYPE_D, 4) /* PIO1_19 */
#define SCT0_IN6_PIO1_19 IOCON_MUX(51, IOCON_TYPE_D, 4) /* PIO1_19 */
#define SCT0_OUT7_PIO1_19 IOCON_MUX(51, IOCON_TYPE_D, 2) /* PIO1_19 */
#define ADC0_TRIG1_PIO1_20 IOCON_MUX(52, IOCON_TYPE_D, 0) /* PIO1_20 */
#define ADC0_TRIG2_PIO1_20 IOCON_MUX(52, IOCON_TYPE_D, 0) /* PIO1_20 */
#define CTIMER3_CAPTURE2_PIO1_20 IOCON_MUX(52, IOCON_TYPE_D, 3) /* PIO1_20 */
#define DMA0_TRIG0_PIO1_20 IOCON_MUX(52, IOCON_TYPE_D, 0) /* PIO1_20 */
#define DMA0_TRIG10_PIO1_20 IOCON_MUX(52, IOCON_TYPE_D, 0) /* PIO1_20 */
#define DMA0_TRIG11_PIO1_20 IOCON_MUX(52, IOCON_TYPE_D, 0) /* PIO1_20 */
#define DMA0_TRIG12_PIO1_20 IOCON_MUX(52, IOCON_TYPE_D, 0) /* PIO1_20 */
#define DMA0_TRIG13_PIO1_20 IOCON_MUX(52, IOCON_TYPE_D, 0) /* PIO1_20 */
#define DMA0_TRIG14_PIO1_20 IOCON_MUX(52, IOCON_TYPE_D, 0) /* PIO1_20 */
#define DMA0_TRIG15_PIO1_20 IOCON_MUX(52, IOCON_TYPE_D, 0) /* PIO1_20 */
#define DMA0_TRIG16_PIO1_20 IOCON_MUX(52, IOCON_TYPE_D, 0) /* PIO1_20 */
#define DMA0_TRIG17_PIO1_20 IOCON_MUX(52, IOCON_TYPE_D, 0) /* PIO1_20 */
#define DMA0_TRIG18_PIO1_20 IOCON_MUX(52, IOCON_TYPE_D, 0) /* PIO1_20 */
#define DMA0_TRIG19_PIO1_20 IOCON_MUX(52, IOCON_TYPE_D, 0) /* PIO1_20 */
#define DMA0_TRIG1_PIO1_20 IOCON_MUX(52, IOCON_TYPE_D, 0) /* PIO1_20 */
#define DMA0_TRIG20_PIO1_20 IOCON_MUX(52, IOCON_TYPE_D, 0) /* PIO1_20 */
#define DMA0_TRIG21_PIO1_20 IOCON_MUX(52, IOCON_TYPE_D, 0) /* PIO1_20 */
#define DMA0_TRIG22_PIO1_20 IOCON_MUX(52, IOCON_TYPE_D, 0) /* PIO1_20 */
#define DMA0_TRIG23_PIO1_20 IOCON_MUX(52, IOCON_TYPE_D, 0) /* PIO1_20 */
#define DMA0_TRIG24_PIO1_20 IOCON_MUX(52, IOCON_TYPE_D, 0) /* PIO1_20 */
#define DMA0_TRIG25_PIO1_20 IOCON_MUX(52, IOCON_TYPE_D, 0) /* PIO1_20 */
#define DMA0_TRIG26_PIO1_20 IOCON_MUX(52, IOCON_TYPE_D, 0) /* PIO1_20 */
#define DMA0_TRIG27_PIO1_20 IOCON_MUX(52, IOCON_TYPE_D, 0) /* PIO1_20 */
#define DMA0_TRIG28_PIO1_20 IOCON_MUX(52, IOCON_TYPE_D, 0) /* PIO1_20 */
#define DMA0_TRIG29_PIO1_20 IOCON_MUX(52, IOCON_TYPE_D, 0) /* PIO1_20 */
#define DMA0_TRIG2_PIO1_20 IOCON_MUX(52, IOCON_TYPE_D, 0) /* PIO1_20 */
#define DMA0_TRIG3_PIO1_20 IOCON_MUX(52, IOCON_TYPE_D, 0) /* PIO1_20 */
#define DMA0_TRIG4_PIO1_20 IOCON_MUX(52, IOCON_TYPE_D, 0) /* PIO1_20 */
#define DMA0_TRIG5_PIO1_20 IOCON_MUX(52, IOCON_TYPE_D, 0) /* PIO1_20 */
#define DMA0_TRIG6_PIO1_20 IOCON_MUX(52, IOCON_TYPE_D, 0) /* PIO1_20 */
#define DMA0_TRIG7_PIO1_20 IOCON_MUX(52, IOCON_TYPE_D, 0) /* PIO1_20 */
#define DMA0_TRIG8_PIO1_20 IOCON_MUX(52, IOCON_TYPE_D, 0) /* PIO1_20 */
#define DMA0_TRIG9_PIO1_20 IOCON_MUX(52, IOCON_TYPE_D, 0) /* PIO1_20 */
#define EMC_EMC_D9_PIO1_20 IOCON_MUX(52, IOCON_TYPE_D, 6) /* PIO1_20 */
#define FC4_TXD_SCL_MISO_PIO1_20 IOCON_MUX(52, IOCON_TYPE_D, 5) /* PIO1_20 */
#define FC7_RTS_SCL_SSEL1_PIO1_20 IOCON_MUX(52, IOCON_TYPE_D, 1) /* PIO1_20 */
#define GPIO_PIO120_PIO1_20 IOCON_MUX(52, IOCON_TYPE_D, 0) /* PIO1_20 */
#define PINT_PINT0_PIO1_20 IOCON_MUX(52, IOCON_TYPE_D, 0) /* PIO1_20 */
#define PINT_PINT1_PIO1_20 IOCON_MUX(52, IOCON_TYPE_D, 0) /* PIO1_20 */
#define PINT_PINT2_PIO1_20 IOCON_MUX(52, IOCON_TYPE_D, 0) /* PIO1_20 */
#define PINT_PINT3_PIO1_20 IOCON_MUX(52, IOCON_TYPE_D, 0) /* PIO1_20 */
#define PINT_PINT4_PIO1_20 IOCON_MUX(52, IOCON_TYPE_D, 0) /* PIO1_20 */
#define PINT_PINT5_PIO1_20 IOCON_MUX(52, IOCON_TYPE_D, 0) /* PIO1_20 */
#define PINT_PINT6_PIO1_20 IOCON_MUX(52, IOCON_TYPE_D, 0) /* PIO1_20 */
#define PINT_PINT7_PIO1_20 IOCON_MUX(52, IOCON_TYPE_D, 0) /* PIO1_20 */
#define ADC0_TRIG1_PIO1_21 IOCON_MUX(53, IOCON_TYPE_D, 0) /* PIO1_21 */
#define ADC0_TRIG2_PIO1_21 IOCON_MUX(53, IOCON_TYPE_D, 0) /* PIO1_21 */
#define CTIMER3_MATCH2_PIO1_21 IOCON_MUX(53, IOCON_TYPE_D, 3) /* PIO1_21 */
#define DMA0_TRIG0_PIO1_21 IOCON_MUX(53, IOCON_TYPE_D, 0) /* PIO1_21 */
#define DMA0_TRIG10_PIO1_21 IOCON_MUX(53, IOCON_TYPE_D, 0) /* PIO1_21 */
#define DMA0_TRIG11_PIO1_21 IOCON_MUX(53, IOCON_TYPE_D, 0) /* PIO1_21 */
#define DMA0_TRIG12_PIO1_21 IOCON_MUX(53, IOCON_TYPE_D, 0) /* PIO1_21 */
#define DMA0_TRIG13_PIO1_21 IOCON_MUX(53, IOCON_TYPE_D, 0) /* PIO1_21 */
#define DMA0_TRIG14_PIO1_21 IOCON_MUX(53, IOCON_TYPE_D, 0) /* PIO1_21 */
#define DMA0_TRIG15_PIO1_21 IOCON_MUX(53, IOCON_TYPE_D, 0) /* PIO1_21 */
#define DMA0_TRIG16_PIO1_21 IOCON_MUX(53, IOCON_TYPE_D, 0) /* PIO1_21 */
#define DMA0_TRIG17_PIO1_21 IOCON_MUX(53, IOCON_TYPE_D, 0) /* PIO1_21 */
#define DMA0_TRIG18_PIO1_21 IOCON_MUX(53, IOCON_TYPE_D, 0) /* PIO1_21 */
#define DMA0_TRIG19_PIO1_21 IOCON_MUX(53, IOCON_TYPE_D, 0) /* PIO1_21 */
#define DMA0_TRIG1_PIO1_21 IOCON_MUX(53, IOCON_TYPE_D, 0) /* PIO1_21 */
#define DMA0_TRIG20_PIO1_21 IOCON_MUX(53, IOCON_TYPE_D, 0) /* PIO1_21 */
#define DMA0_TRIG21_PIO1_21 IOCON_MUX(53, IOCON_TYPE_D, 0) /* PIO1_21 */
#define DMA0_TRIG22_PIO1_21 IOCON_MUX(53, IOCON_TYPE_D, 0) /* PIO1_21 */
#define DMA0_TRIG23_PIO1_21 IOCON_MUX(53, IOCON_TYPE_D, 0) /* PIO1_21 */
#define DMA0_TRIG24_PIO1_21 IOCON_MUX(53, IOCON_TYPE_D, 0) /* PIO1_21 */
#define DMA0_TRIG25_PIO1_21 IOCON_MUX(53, IOCON_TYPE_D, 0) /* PIO1_21 */
#define DMA0_TRIG26_PIO1_21 IOCON_MUX(53, IOCON_TYPE_D, 0) /* PIO1_21 */
#define DMA0_TRIG27_PIO1_21 IOCON_MUX(53, IOCON_TYPE_D, 0) /* PIO1_21 */
#define DMA0_TRIG28_PIO1_21 IOCON_MUX(53, IOCON_TYPE_D, 0) /* PIO1_21 */
#define DMA0_TRIG29_PIO1_21 IOCON_MUX(53, IOCON_TYPE_D, 0) /* PIO1_21 */
#define DMA0_TRIG2_PIO1_21 IOCON_MUX(53, IOCON_TYPE_D, 0) /* PIO1_21 */
#define DMA0_TRIG3_PIO1_21 IOCON_MUX(53, IOCON_TYPE_D, 0) /* PIO1_21 */
#define DMA0_TRIG4_PIO1_21 IOCON_MUX(53, IOCON_TYPE_D, 0) /* PIO1_21 */
#define DMA0_TRIG5_PIO1_21 IOCON_MUX(53, IOCON_TYPE_D, 0) /* PIO1_21 */
#define DMA0_TRIG6_PIO1_21 IOCON_MUX(53, IOCON_TYPE_D, 0) /* PIO1_21 */
#define DMA0_TRIG7_PIO1_21 IOCON_MUX(53, IOCON_TYPE_D, 0) /* PIO1_21 */
#define DMA0_TRIG8_PIO1_21 IOCON_MUX(53, IOCON_TYPE_D, 0) /* PIO1_21 */
#define DMA0_TRIG9_PIO1_21 IOCON_MUX(53, IOCON_TYPE_D, 0) /* PIO1_21 */
#define EMC_EMC_D10_PIO1_21 IOCON_MUX(53, IOCON_TYPE_D, 6) /* PIO1_21 */
#define FC4_RXD_SDA_MOSI_PIO1_21 IOCON_MUX(53, IOCON_TYPE_D, 5) /* PIO1_21 */
#define FC7_CTS_SDA_SSEL0_PIO1_21 IOCON_MUX(53, IOCON_TYPE_D, 1) /* PIO1_21 */
#define GPIO_PIO121_PIO1_21 IOCON_MUX(53, IOCON_TYPE_D, 0) /* PIO1_21 */
#define PINT_PINT0_PIO1_21 IOCON_MUX(53, IOCON_TYPE_D, 0) /* PIO1_21 */
#define PINT_PINT1_PIO1_21 IOCON_MUX(53, IOCON_TYPE_D, 0) /* PIO1_21 */
#define PINT_PINT2_PIO1_21 IOCON_MUX(53, IOCON_TYPE_D, 0) /* PIO1_21 */
#define PINT_PINT3_PIO1_21 IOCON_MUX(53, IOCON_TYPE_D, 0) /* PIO1_21 */
#define PINT_PINT4_PIO1_21 IOCON_MUX(53, IOCON_TYPE_D, 0) /* PIO1_21 */
#define PINT_PINT5_PIO1_21 IOCON_MUX(53, IOCON_TYPE_D, 0) /* PIO1_21 */
#define PINT_PINT6_PIO1_21 IOCON_MUX(53, IOCON_TYPE_D, 0) /* PIO1_21 */
#define PINT_PINT7_PIO1_21 IOCON_MUX(53, IOCON_TYPE_D, 0) /* PIO1_21 */
#define ADC0_TRIG1_PIO1_22 IOCON_MUX(54, IOCON_TYPE_D, 0) /* PIO1_22 */
#define ADC0_TRIG2_PIO1_22 IOCON_MUX(54, IOCON_TYPE_D, 0) /* PIO1_22 */
#define CTIMER2_MATCH3_PIO1_22 IOCON_MUX(54, IOCON_TYPE_D, 3) /* PIO1_22 */
#define DMA0_TRIG0_PIO1_22 IOCON_MUX(54, IOCON_TYPE_D, 0) /* PIO1_22 */
#define DMA0_TRIG10_PIO1_22 IOCON_MUX(54, IOCON_TYPE_D, 0) /* PIO1_22 */
#define DMA0_TRIG11_PIO1_22 IOCON_MUX(54, IOCON_TYPE_D, 0) /* PIO1_22 */
#define DMA0_TRIG12_PIO1_22 IOCON_MUX(54, IOCON_TYPE_D, 0) /* PIO1_22 */
#define DMA0_TRIG13_PIO1_22 IOCON_MUX(54, IOCON_TYPE_D, 0) /* PIO1_22 */
#define DMA0_TRIG14_PIO1_22 IOCON_MUX(54, IOCON_TYPE_D, 0) /* PIO1_22 */
#define DMA0_TRIG15_PIO1_22 IOCON_MUX(54, IOCON_TYPE_D, 0) /* PIO1_22 */
#define DMA0_TRIG16_PIO1_22 IOCON_MUX(54, IOCON_TYPE_D, 0) /* PIO1_22 */
#define DMA0_TRIG17_PIO1_22 IOCON_MUX(54, IOCON_TYPE_D, 0) /* PIO1_22 */
#define DMA0_TRIG18_PIO1_22 IOCON_MUX(54, IOCON_TYPE_D, 0) /* PIO1_22 */
#define DMA0_TRIG19_PIO1_22 IOCON_MUX(54, IOCON_TYPE_D, 0) /* PIO1_22 */
#define DMA0_TRIG1_PIO1_22 IOCON_MUX(54, IOCON_TYPE_D, 0) /* PIO1_22 */
#define DMA0_TRIG20_PIO1_22 IOCON_MUX(54, IOCON_TYPE_D, 0) /* PIO1_22 */
#define DMA0_TRIG21_PIO1_22 IOCON_MUX(54, IOCON_TYPE_D, 0) /* PIO1_22 */
#define DMA0_TRIG22_PIO1_22 IOCON_MUX(54, IOCON_TYPE_D, 0) /* PIO1_22 */
#define DMA0_TRIG23_PIO1_22 IOCON_MUX(54, IOCON_TYPE_D, 0) /* PIO1_22 */
#define DMA0_TRIG24_PIO1_22 IOCON_MUX(54, IOCON_TYPE_D, 0) /* PIO1_22 */
#define DMA0_TRIG25_PIO1_22 IOCON_MUX(54, IOCON_TYPE_D, 0) /* PIO1_22 */
#define DMA0_TRIG26_PIO1_22 IOCON_MUX(54, IOCON_TYPE_D, 0) /* PIO1_22 */
#define DMA0_TRIG27_PIO1_22 IOCON_MUX(54, IOCON_TYPE_D, 0) /* PIO1_22 */
#define DMA0_TRIG28_PIO1_22 IOCON_MUX(54, IOCON_TYPE_D, 0) /* PIO1_22 */
#define DMA0_TRIG29_PIO1_22 IOCON_MUX(54, IOCON_TYPE_D, 0) /* PIO1_22 */
#define DMA0_TRIG2_PIO1_22 IOCON_MUX(54, IOCON_TYPE_D, 0) /* PIO1_22 */
#define DMA0_TRIG3_PIO1_22 IOCON_MUX(54, IOCON_TYPE_D, 0) /* PIO1_22 */
#define DMA0_TRIG4_PIO1_22 IOCON_MUX(54, IOCON_TYPE_D, 0) /* PIO1_22 */
#define DMA0_TRIG5_PIO1_22 IOCON_MUX(54, IOCON_TYPE_D, 0) /* PIO1_22 */
#define DMA0_TRIG6_PIO1_22 IOCON_MUX(54, IOCON_TYPE_D, 0) /* PIO1_22 */
#define DMA0_TRIG7_PIO1_22 IOCON_MUX(54, IOCON_TYPE_D, 0) /* PIO1_22 */
#define DMA0_TRIG8_PIO1_22 IOCON_MUX(54, IOCON_TYPE_D, 0) /* PIO1_22 */
#define DMA0_TRIG9_PIO1_22 IOCON_MUX(54, IOCON_TYPE_D, 0) /* PIO1_22 */
#define EMC_EMC_CKE1_PIO1_22 IOCON_MUX(54, IOCON_TYPE_D, 6) /* PIO1_22 */
